Revit 2027 API
Wire.RemoveVertex Method
 Removes the vertex corresponding to the specified index. Can not remove the start or end vertex if it already connects to other element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveVertex(
	int index
)
Public Sub RemoveVertex (
	index As Integer
)
public:
void RemoveVertex(
	int index
)
member RemoveVertex :
        index : int -> unit
Parameters
index Int32
 The index which should be in [0, NumberOfVertices).
Exceptions
Exception | Condition
ArgumentException |  The index should be between 0 and the number of vertices of the wire.
InvalidOperationException |  The wire has only 2 vertices, so one cannot be removed. -or- Can't remove the vertex when the vertex is start or end point and the wire connects to one element.
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace